RIET/src/Documents/InventoryКорректировка/InventoryКорректировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InventoryКорректировка</name>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>AccumulationRegister.MaterialsAndSupplies</registerRecords>
  <registerRecords>AccumulationRegister.InventoryTangibleAssetsCosts</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBatches</registerRecords>
  <registerRecords>AccumulationRegister.МатериальныеАктивы</registerRecords>
  <attributes>
    <name>InventoryLocation</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>PoNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PO</name>
    <type>
      <types>CatalogRef.ЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>IctDocType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HasFinishedGoods</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OriginalDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.InventoryTransactionsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>InventoryСписание</name>
    <type>
      <types>DocumentRef.InventoryСписание</types>
      <types>DocumentRef.InventoryКорректировка</types>
    </type>
  </attributes>
  <attributes>
    <name>OrdNum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Good</name>
      <type>
        <types>CatalogRef.InventoryGoods</types>
      </type>
    </attributes>
    <attributes>
      <name>UOM</name>
      <type>
        <types>CatalogRef.UOMs</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FiscalPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FiscalSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FinishedGood</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ManagementPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ManagementSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>DocumentRef.InventoryПоступление</types>
        <types>DocumentRef.InventoryКорректировка</types>
        <types>DocumentRef.InventoryПеремещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Reference</name>
      <type>
        <types>CatalogRef.КомментарииКорректировок</types>
      </type>
    </attributes>
    <attributes>
      <name>DSS</name>
      <type>
        <types>DocumentRef.ПроводкаDSS</types>
      </type>
    </attributes>
    <attributes>
      <name>PoNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/InventoryBatches/InventoryBatches.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>InventoryBatches</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Fiscal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FiscalPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Good</name>
    <type>
      <types>CatalogRef.InventoryGoods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>InventoryLocation</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>DocumentRef.InventoryПоступление</types>
      <types>DocumentRef.InventoryКорректировка</types>
      <types>DocumentRef.InventoryПеремещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FinishedGood</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/InventoryКорректировка/ManagerModule.bsl
Процедура ПриказНаСписание(Объект) Экспорт
	ТабДок = ПечатьПриказНаСписание(Объект);
	ТабДок.Показать();
КонецПроцедуры

Функция ПечатьПриказНаСписание(Объект)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_InventoryКорректировка_ПечатьПриказаНаСписание";
	Макет = Документы.InventoryКорректировка.ПолучитьМакет("Junk_ПриказОСписании"); 	
	//[РКХ->]
	Если ОбщегоНазначенияПовтИсп.ИдентификаторРабочейКонфигурации() = "PA" Тогда
   		ОбластьШапки = Макет.ПолучитьОбласть("ОбластьШапкаВариант2");
		ОбластьШапки.Параметры.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
	Иначе
		ОбластьШапки = Макет.ПолучитьОбласть("ОбластьШапкаВариант1");
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьШапки);
	//[<-РКХ]     	
	ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПечати");	
	ОбластьМакета.Параметры.НомерПриказа = Объект.OrdNum;
	ОбластьМакета.Параметры.ДатаДокумента = Формат(Объект.Дата,"ДФ='""''""dd""''''"" MMMM yyyy'");
	ОбластьМакета.Параметры.КонецГода = Формат(КонецГода(Объект.Дата),"ДФ='""''""dd""''''"" MMMM yyyy'");
	ТабДокумент.Вывести(ОбластьМакета);
	Возврат ТабДокумент;	
КонецФункции

Процедура АктОСписании(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	InventoryКорректировкаGoods.Good КАК Гуд
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка = &Регистратор
	|	И InventoryКорректировкаGoods.Reference.Наименование ПОДОБНО ""%dispos%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(InventoryBatches.Quantity) КАК Quantity,
	|	МАКСИМУМ(InventoryBatches.Sum) КАК Sum,
	|	InventoryBatches.Good.Код,
	|	ВЫРАЗИТЬ(InventoryBatches.Good.DescriptionRus КАК Строка(200)) КАК GoodНаименование,
	|	InventoryBatches.Good.StandardUOM.BasicUOM.Наименование
	|ИЗ
	|	РегистрНакопления.InventoryBatches КАК InventoryBatches
	|ГДЕ
	|	InventoryBatches.Регистратор = &Регистратор
	|	И InventoryBatches.Good В
	|			(ВЫБРАТЬ
	|				тч.Гуд
	|			ИЗ
	|				тч)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(InventoryBatches.Good.DescriptionRus КАК Строка(200)),
	|	InventoryBatches.Good.Код,
	|	InventoryBatches.Good.StandardUOM.BasicUOM.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	GoodНаименование";
	Запрос.УстановитьПараметр("Регистратор", Объект);
	Результат = Запрос.Выполнить().Выгрузить();
	ТабДок = ПечатьАктОСписании(Объект,Результат);
	ТабДок.Показать();
КонецПроцедуры

Функция ПечатьАктОСписании(Объект,ТаблицаЗаписей)
	Перем мВалютаРегламентированногоУчета;
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаПечати = мВалютаРегламентированногоУчета;
	ТабДокумент = Новый ТабличныйДокумент;
	ДопДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_InventoryКорректировка_ПечатьАктаОСписании";
	Макет = Документы.InventoryКорректировка.ПолучитьМакет("Junk_АктОСписанииМатЗапасов");
	//Первая Страница
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакетаПодвал.Параметры.Итого = Формат(ТаблицаЗаписей.Итог("Sum"),"ЧЦ=15; ЧДЦ=2");
	ОбластьМакетаПодвал.Параметры.СуммаПрописью = РаботаСДиалогами.СформироватьСуммуПрописью(ТаблицаЗаписей.Итог("Sum"),ВалютаПечати);
	ОбластьМакета.Параметры.ДатаДокумента = Формат(Объект.Дата,"ДФ='""''""dd""''''"" MMMM yyyy'");
	ОбластьМакета.Параметры.ДатаКратко = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
	//-> RG-Soft VIvanov 07/06/12
	//Орг = Справочники.Организации.НайтиПоКоду("00001"); 
	Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	//<- RG-Soft
	ОбластьМакета.Параметры.ОрганизацияПолноеНаим = Орг.НаименованиеПолное;
	ОбластьМакета.Параметры.ОрганизацияОКПО = Орг.КодПоОКПО;
	ОбластьМакета.Параметры.Подразделение = Объект.TaxRegistration.НаименованиеПолное;
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакетаШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТабл1");
	ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка1");
	ОбластьМакетаСтрокаПустая = Макет.ПолучитьОбласть("Строка1");
	Для каждого стр Из ТаблицаЗаписей Цикл
		ОбластьМакетаСтрока.Параметры.Good = стр.GoodНаименование;
		ОбластьМакетаСтрока.Параметры.itemCode = стр.GoodКод;
		ОбластьМакетаСтрока.Параметры.UOM	= стр.GoodStandardUOMBasicUOMНаименование;
		ОбластьМакетаСтрока.Параметры.Qty = Формат(стр.Quantity,"ЧЦ=15; ЧДЦ=3");
		Если стр.Quantity <> 0 Тогда
		ОбластьМакетаСтрока.Параметры.Price = Формат(стр.Sum / стр.Quantity,"ЧЦ=15; ЧДЦ=2; ЧН=");
		КонецЕсли;
		ОбластьМакетаСтрока.Параметры.Sum = Формат(стр.Sum,"ЧЦ=15; ЧДЦ=2");
		Если ТабДокумент.ПроверитьВывод(ОбластьМакетаСтрока) Тогда
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
		Иначе
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
   		КонецЕсли;
	КонецЦикла;
	Если НЕ ТабДокумент.ПроверитьВывод(ОбластьМакетаПодвал) Тогда
		Пока ТабДокумент.ПроверитьВывод(ОбластьМакетаСтрокаПустая) Цикл
			ТабДокумент.Вывести(ОбластьМакетаСтрокаПустая);	
		КонецЦикла;
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
		ТабДокумент.Вывести(ОбластьМакетаСтрокаПустая);
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
	Иначе
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
	КонецЕсли;	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьАктОСписании()

Процедура БухСправка(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	InventoryКорректировкаGoods.Good КАК Гуд
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка = &Регистратор
	|	И InventoryКорректировкаGoods.Reference.Наименование ПОДОБНО ""%eturn%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(InventoryBatches.Quantity) КАК Quantity,
	|	МАКСИМУМ(InventoryBatches.Sum) КАК Sum,
	|	InventoryBatches.Good.Код
	|ИЗ
	|	РегистрНакопления.InventoryBatches КАК InventoryBatches
	|ГДЕ
	|	InventoryBatches.Регистратор = &Регистратор
	|	И InventoryBatches.Good В
	|			(ВЫБРАТЬ
	|				тч.Гуд
	|			ИЗ
	|				тч)
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryBatches.Good.Код";
	Запрос.УстановитьПараметр("Регистратор", Объект);
	Результат = Запрос.Выполнить().Выгрузить();
	ТабДок = ПечатьБухСправка(Объект,Результат);
	ТабДок.Показать();
	
КонецПроцедуры

Функция ПечатьБухСправка(Объект,ТаблицаЗаписей)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_InventoryКорректировка_ПечатьБухСправка";
	Макет = Документы.InventoryКорректировка.ПолучитьМакет("Return_БухСправка");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подписи");
	Орг = Объект.TaxRegistration;
	СведенияОбОрганизации = КонтактнаяИнформация.СведенияОЮрФизЛице(Орг,Объект.Дата);
	
	Шапка.Параметры.Наименование = СведенияОбОрганизации.ПолноеНаименование;
	Шапка.Параметры.ИНН = СведенияОбОрганизации.ИНН;
	Шапка.Параметры.КПП = СведенияОбОрганизации.КПП;
	Шапка.Параметры.Адрес = СведенияОбОрганизации.ФактическийАдрес;
	Шапка.Параметры.Телефон = СведенияОбОрганизации.Телефоны;
	Шапка.Параметры.Номер = Объект.Номер;
	Шапка.Параметры.Дата = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(Шапка);
	ТабДокумент.Вывести(ШапкаТаблицы);
	
	сч = 1;
	Для каждого стр Из ТаблицаЗаписей Цикл
		Строка.Параметры.N = сч;
		Строка.Параметры.НомСписания = Объект.InventoryСписание.Номер;
		Строка.Параметры.TaxRegСписания = Объект.InventoryСписание.TaxRegistration.Код;
		Строка.Параметры.КодGood = стр.GoodКод;
		Строка.Параметры.Количество = Формат(стр.Quantity,"ЧЦ=15; ЧДЦ=3");
		Строка.Параметры.Сумма = Формат(стр.Sum,"ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Вывести(Строка);
		сч = сч + 1;
	КонецЦикла;
	ТабДокумент.Вывести(Подвал);
	Возврат ТабДокумент;	
	
КонецФункции


Процедура БухСправкаReclas(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	InventoryКорректировкаGoods.Good КАК Гуд
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка = &Регистратор
	|	И InventoryКорректировкаGoods.Reference.Наименование ПОДОБНО ""%recl%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(InventoryBatches.Quantity) КАК Quantity,
	|	МАКСИМУМ(InventoryBatches.Sum) КАК Sum,
	|	InventoryBatches.Good.Код
	|ИЗ
	|	РегистрНакопления.InventoryBatches КАК InventoryBatches
	|ГДЕ
	|	InventoryBatches.Регистратор = &Регистратор
	|	И InventoryBatches.Good В
	|			(ВЫБРАТЬ
	|				тч.Гуд
	|			ИЗ
	|				тч)
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryBatches.Good.Код";
	Запрос.УстановитьПараметр("Регистратор", Объект);
	Результат = Запрос.Выполнить().Выгрузить();
	ТабДок = ПечатьБухСправкаReclas(Объект,Результат);
	ТабДок.Показать();
	
КонецПроцедуры

Функция ПечатьБухСправкаReclas(Объект,ТаблицаЗаписей)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_InventoryКорректировка_ПечатьБухСправкаReclas";
	Макет = Документы.InventoryКорректировка.ПолучитьМакет("ReclasToMAndS_БухСправка");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подписи");
	Орг = Объект.TaxRegistration;
	СведенияОбОрганизации = КонтактнаяИнформация.СведенияОЮрФизЛице(Орг,Объект.Дата);
	
	Шапка.Параметры.Наименование = СведенияОбОрганизации.ПолноеНаименование;
	Шапка.Параметры.ИНН = СведенияОбОрганизации.ИНН;
	Шапка.Параметры.КПП = СведенияОбОрганизации.КПП;
	Шапка.Параметры.Адрес = СведенияОбОрганизации.ФактическийАдрес;
	Шапка.Параметры.Телефон = СведенияОбОрганизации.Телефоны;
	Шапка.Параметры.Номер = Объект.Номер;
	Шапка.Параметры.Дата = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(Шапка);
	ТабДокумент.Вывести(ШапкаТаблицы);
	
	сч = 1;
	Для каждого стр Из ТаблицаЗаписей Цикл
		Строка.Параметры.N = сч;
		Если стр.Quantity > 0 ИЛИ стр.Quantity = 0 Тогда 
		Строка.Параметры.НомСписанияДТ = "inventory";
		Строка.Параметры.НомСписанияКТ = "M&S";
	Иначе
		Строка.Параметры.НомСписанияДТ = "M&S";
		Строка.Параметры.НомСписанияКТ = "inventory";
        КонецЕсли;
		Строка.Параметры.TaxRegСписания = Объект.TaxRegistration.Код;
		Строка.Параметры.КодGood = стр.GoodКод;
		Строка.Параметры.Количество = Формат(стр.Quantity,"ЧЦ=15; ЧДЦ=3");
		Строка.Параметры.Сумма = Формат(стр.Sum,"ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Вывести(Строка);
		сч = сч + 1;
	КонецЦикла;
	ТабДокумент.Вывести(Подвал);
	Возврат ТабДокумент;	
	
КонецФункции
